Repository: Mullernes/cardcheck
Catalog: CardCheck/CardCheck/Localization/*.lproj/Authorization.strings
Languages: ru, uk

# auth_loginID_phone_alert_message_text
source: Please, check the phone number you entered and press SEND SMS
ru: Пожалуйста, проверьте введенный номер телефона и нажмите ОТПРАВИТЬ СМС
uk: Будь ласка, перевірте введений вами номер телефону та натисніть ВІДПРАВИТИ СМС

# auth_loginID_phone_alert_button_change_title
source: Change
ru: Изменить
uk: Змінити

# auth_loginID_phone_alert_button_sendsms_title
source: SEND SMS
ru: OТПРАВИТЬ СМС
uk: ВІДПРАВИТИ SMS

# auth_loginID_email_alert_message_text
source: Please, check the email address you entered and press SEND CODE
ru: Пожалуйста, проверьте введенный адрес электронной почты и нажмите ОТПРАВИТЬ КОД
uk: Будь-ласка, перевірте введену адресу електронної пошти та натисніть ВІДПРАВИТИ КОД

# auth_loginID_email_alert_button_change_title
source: Change
ru: Изменить
uk: Змінити

# auth_loginID_email_alert_button_sendsms_title
source: SEND CODE
ru: OТПРАВИТЬ КОД
uk: ВІДПРАВИТИ КОД

# auth_loginID_signUpLogin_alert_message_text
source: Please, check the login you entered and press Register
ru: Пожалуйста, проверьте введенный логин и нажмите Регистрация
uk: Будь-ласка, перевірте логін, який ви ввели, і натисніть Реєстрація

# auth_loginID_signUpEmail_alert_message_text
source: Please, check the email you entered and press Register
ru: Пожалуйста, проверьте введенный адрес электронной почты и нажмите Регистрация
uk: Будь-ласка, перевірте введену адресу електронної пошти і натисніть Реєстрація

# auth_loginID_signUpPhone_alert_message_text
source: Please, check the phone number you entered and press Register
ru: Пожалуйста, проверьте введенный номер телефона и нажмите Регистрация
uk: Будь ласка, перевірте введений вами номер телефону та натисніть Реєстрація

# auth_loginID_signUp_alert_button_cancel_title
source: Cancel
ru: Отмена
uk: Відміна

# auth_loginID_signUp_alert_button_continue_title
source: Register
ru: Регистрация
uk: Реєстрація

# login_default_validation_text
source: Login must be at least 4 characters (latin letters, numbers), or phone number, or email
ru: Логин должен быть не менее 4 символов (латинские буквы, цифры, точка) или номер телефона или email
uk: Логін повинен містити щонайменше 4 символи (латинські літери, цифри, точка), або номер телефону або email

# password_default_validation_text
source: Password must contain at least 4 symbols
ru: Пароль должен содержать не менее 4 символов
uk: Пароль повинен містити принаймні 4 символи

# password_equality_validation_text
source: Passwords must be the same
ru: Пароли должны совпадать
uk: Паролі повинні бути однаковими

# password_invalid_validation_text
source: Invalid password. please, try again
ru: Неверный пароль. Пожалуйста попробуйте еще раз
uk: Невірний пароль. Будь ласка спробуйте ще раз

# not_defined_signin_error_{%@}
source: SIGNIN ERROR {%@}
uk: ПОМИЛКА АВТОРИЗАЦІЇ {%@}

# not_defined_signup_error_{%@}
source: SIGNUP ERROR {%@}
uk: ПОМИЛКА РЕЄСТРАЦІЇ {%@}

# login_is_not_exists
source: COULDN'T SIGNIN. SUCH LOGIN DOESN'T EXIST
ru: Ошибка авторизации. Неверный логин
uk: Помилка авторизації. Невірний логін

# password_is_not_exists
source: COULDN'T SIGNIN. INCORRECT PASSWORD
ru: Ошибка авторизации. Неверный пароль
uk: Помилка авторизації. Невірний пароль

# login_is_already_exists
source: COULDN'T SIGNUP. SUCH LOGIN ALREADY EXISTS
ru: Ошибка регистрации. Логин уже занят
uk: Помилка реєстрації. Логін вже зайнятий

# dealer_word_is_not_exists
source: COULDN'T SIGNUP. INCORRECT INVITATION
ru: Ошибка регистрации. Неверное приглашение
uk: Помилка реєстрації. Невірне запрошення
